### Ambiente de preparação

In [1]:
#Importando o sqlite3
import sqlite3

In [2]:
%load_ext sql

In [3]:
# Criando o arquivo do BD
%%sql
sqlite:///banco.db

In [4]:
# definindo o caminho
caminho_banco = '/content/banco.db'

In [5]:
# criando conexao com sqlite3
conexao = sqlite3.connect(caminho_banco)
cursor = conexao.cursor()

### 1. Criando a tabela no BD

In [6]:
cursor.execute('CREATE TABLE alunos(id INT, nome VARCHAR(100), idade INT, curso VARCHAR(50))')

### 2. Inserindo registros no BD

In [7]:
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (1, "Julia", "21", "Desenvolvimento de Sistemas")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (2, "Mario", "28", "Engenharia")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (3, "Marcos", "21", "Educação Física")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (4, "Lauren", "20", "Educação Física")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (5, "Marcos", "19", "Biologia")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (6, "Paulo", "45", "Biologia")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (7, "Bruno", "25", "Física")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (8, "Tatiana", "18", "Engenharia")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (9, "Larissa", "31", "Direito")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (10, "Maria", "50", "Engenharia")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (11, "Juliana", "20", "Administração")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (12, "Julia", "30", "Engenharia")')

### 3.a. Selecionando todos os registros da tabela 'alunos'

In [8]:
dados = cursor.execute('SELECT * FROM alunos')
for alunos in dados:
    print(alunos)

(1, 'Julia', 21, 'Desenvolvimento de Sistemas')
(2, 'Mario', 28, 'Engenharia')
(3, 'Marcos', 21, 'Educação Física')
(4, 'Lauren', 20, 'Educação Física')
(5, 'Marcos', 19, 'Biologia')
(6, 'Paulo', 45, 'Biologia')
(7, 'Bruno', 25, 'Física')
(8, 'Tatiana', 18, 'Engenharia')
(9, 'Larissa', 31, 'Direito')
(10, 'Maria', 50, 'Engenharia')
(11, 'Juliana', 20, 'Administração')
(12, 'Julia', 30, 'Engenharia')

### b. Selecionando NOME E IDADE somente dos alunos com mais de 20 anos

In [9]:
dados = cursor.execute('SELECT nome, idade FROM alunos WHERE idade>20')
for alunos in dados:
    print(alunos)

('Julia', 21)
('Mario', 28)
('Marcos', 21)
('Paulo', 45)
('Bruno', 25)
('Larissa', 31)
('Maria', 50)
('Julia', 30)

### c. Selecionando somente os alunos do curso de "Engenharia"

In [10]:
dados = cursor.execute('SELECT nome FROM alunos WHERE curso = "Engenharia" ORDER BY nome')
for alunos in dados:
    print(alunos)

('Julia',)
('Maria',)
('Mario',)
('Tatiana',)

### d. Contar o número total de alunos na tabela

In [11]:
dados = cursor.execute('SELECT COUNT (nome) FROM alunos')
for alunos in dados:
    print(alunos)

(12,)

### 4.a. Atualizar a idade de um alunos específico na tabela

In [12]:
cursor.execute('UPDATE alunos SET idade = 19 WHERE nome = "Marcos"')
dados = cursor.execute('SELECT * FROM alunos')
for alunos in dados:
    print(alunos)

(1, 'Julia', 21, 'Desenvolvimento de Sistemas')
(2, 'Mario', 28, 'Engenharia')
(3, 'Marcos', 19, 'Educação Física')
(4, 'Lauren', 20, 'Educação Física')
(5, 'Marcos', 19, 'Biologia')
(6, 'Paulo', 45, 'Biologia')
(7, 'Bruno', 25, 'Física')
(8, 'Tatiana', 18, 'Engenharia')
(9, 'Larissa', 31, 'Direito')
(10, 'Maria', 50, 'Engenharia')
(11, 'Juliana', 20, 'Administração')
(12, 'Julia', 30, 'Engenharia')

### b.Remover um aluno pelo seu ID

In [13]:
cursor.execute('DELETE FROM alunos WHERE id=12')
dados = cursor.execute('SELECT * FROM alunos')
for alunos in dados:
    print(alunos)

(1, 'Julia', 21, 'Desenvolvimento de Sistemas')
(2, 'Mario', 28, 'Engenharia')
(3, 'Marcos', 19, 'Educação Física')
(4, 'Lauren', 20, 'Educação Física')
(5, 'Marcos', 19, 'Biologia')
(6, 'Paulo', 45, 'Biologia')
(7, 'Bruno', 25, 'Física')
(8, 'Tatiana', 18, 'Engenharia')
(9, 'Larissa', 31, 'Direito')
(10, 'Maria', 50, 'Engenharia')
(11, 'Juliana', 20, 'Administração')

### 5. Criar uma tbela chamada 'clientes' e inserir alguns registros

In [14]:
cursor.execute('CREATE TABLE clientes(id INT, nome VARCHAR(100), idade INT, saldo FLOAT, CONSTRAINT PK PRIMARY KEY (id))')
  ## inserindo registros
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES (1, "Marcelo", 18, 20.45)')  #usar . para separador de float
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES (2, "Bruna", 45, 350.65)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES (3, "Marcos", 21, 75.18)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES (4, "Lauren", 20, 1549.00)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES (5, "Maiara", 22, 85.25)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES (6, "Elenice", 65, 5.28)')

### 6.a. Selecionar nome e idade dos clientes com idade superior a 30 anos

In [15]:
dados = cursor.execute('SELECT nome, idade FROM clientes WHERE idade>30')
for clientes in dados:
    print(clientes)

('Bruna', 45)
('Elenice', 65)

### b. Calcular o saldo médio dos clientes

In [16]:
dados = cursor.execute('SELECT AVG(saldo) AS saldo_medio FROM clientes')
for clientes in dados:
    print(clientes)

(347.635,)

### c. Encontrar o cliente com o maior saldo

In [17]:
dados = cursor.execute('SELECT MAX(saldo) AS maior_saldo FROM clientes')
for clientes in dados:
    print(clientes)

(1549.0,)

### d. Contar quantos clinetes tem o saldo acima de 1000

In [18]:
dados = cursor.execute('SELECT COUNT(*) AS qtd_clientes FROM clientes WHERE saldo>1000')
for clientes in dados:
    print(clientes)

(1,)


### 7.a. Atualizar o saldo de um cliente específico

In [19]:
cursor.execute('UPDATE clientes SET saldo = 1350.75 WHERE nome = "Elenice"')
dados = cursor.execute('SELECT * FROM clientes')
for clientes in dados:
    print(clientes)

(1, 'Marcelo', 18, 20.45)
(2, 'Bruna', 45, 350.65)
(3, 'Marcos', 21, 75.18)
(4, 'Lauren', 20, 1549.0)
(5, 'Maiara', 22, 85.25)
(6, 'Elenice', 65, 1350.75)

### b. Remover um cliente pelo seu ID

In [20]:
cursor.execute('DELETE FROM clientes WHERE id=1')
dados = cursor.execute('SELECT * FROM clientes')
for clientes in dados:
    print(clientes)

(2, 'Bruna', 45, 350.65)
(3, 'Marcos', 21, 75.18)
(4, 'Lauren', 20, 1549.0)
(5, 'Maiara', 22, 85.25)
(6, 'Elenice', 65, 1350.75)

### 8. Criar uma tabela chamada 'compras'

In [21]:
cursor.execute('CREATE TABLE compras(id INT PRIMARY KEY, cliente_id INT, produto VARCHAR(100), valor REAL, FOREIGN KEY (cliente_id) REFERENCES clientes(id))')
 ## inserindo registros
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES (1, 2, "teclado", 150.28)') # usar . para separador de ,
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES (2, 2, "mouse", 75.40)')
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES (3, 7, "monitor", 900.49)')
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES (4, 3, "mouse", 30.99)')
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES (5, 4, "bombom", 14.98)')
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES (6, 6, "celular", 895.98)')
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES (7, 8, "freezer", 7045.98)') # máx 6digitos real??

In [22]:
dados = cursor.execute('SELECT clientes.nome, compras.produto, compras.valor FROM clientes JOIN compras ON clientes.id = compras.cliente_id')
for compras in dados:
    print(compras)

('Bruna', 'teclado', 150.28)
('Bruna', 'mouse', 75.4)
('Marcos', 'mouse', 30.99)
('Lauren', 'bombom', 14.98)
('Elenice', 'celular', 895.98)

In [23]:
conexao.commit()
conexao.close()